<a href="https://colab.research.google.com/github/unbrae/DataScience/blob/main/eda.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

In [ ]:
# Exploração inicial dos dados do primeiro DataSet: Working Hours Per Week

df1 = pd.read_csv('https://raw.githubusercontent.com/unbrae/DataScience/dataSets/working_hours_per_week.csv')
df1 = pd.DataFrame(df1)
df1.rename(columns={'country':'Country'})
df1 = df1[['country','2015']]

print(f'Estrutura do DataFrame\n')
display(df1.shape)
print(f'\nPrimeiras 5 linhas do DataFrame\n')
display(df1.head())
print(f'\nÚltimas 5 linhas do DataFrame\n')
display(df1.tail())
print(f'\nSoma de valores duplicados\n')
display(df1.country.duplicated().sum())
print(f'\nValor mínimo, máximo e média da coluna 2015\n')
display(df1['2015'].min(),df1['2015'].max(),df1['2015'].mean())

Estrutura do DataFrame

(137, 2)

Primeiras 5 linhas do DataFrame

                country  2015
0                 Aruba   NaN
1               Albania  39.6
2  United Arab Emirates   NaN
3             Argentina  42.9
4               Armenia  37.9

Últimas 5 linhas do DataFrame

          country  2015
132       Vietnam  41.3
133         Samoa   NaN
134         Yemen   NaN
135  South Africa  43.3
136      Zimbabwe   NaN

Soma de valores duplicados

0

Valor mínimo, máximo e média da coluna 2015

32.4

50.0

40.23033707865167

In [ ]:
# Exploração incial dos dados do segundo DataSet: Life Expectancy

df2 = pd.read_csv('https://raw.githubusercontent.com/Rogerio-mack/Visualizacao-de-Dados-em-Python/main/data/Life_Expectancy_Data.csv')
df2.rename(columns={' BMI ':'BMI', 'Life expectancy ':'Life_expectancy'}, inplace=True)
df2 = df2[df2.Year == 2015]
df2 = df2[['Country','Year','Status','Adult Mortality','GDP','Population','Schooling']]

print(f'Estrutura do DataFrame\n')
display(df2.shape)
print(f'\nPrimeiras 5 linhas do DataFrame\n')
display(df2.head())
print(f'\nÚltimas 5 linhas do DataFrame\n')
display(df2.tail())

Estrutura do DataFrame

(183, 7)

Primeiras 5 linhas do DataFrame

                Country  Year      Status  ...           GDP  Population  Schooling
0           Afghanistan  2015  Developing  ...    584.259210  33736494.0       10.1
16              Albania  2015  Developing  ...   3954.227830     28873.0       14.2
32              Algeria  2015  Developing  ...   4132.762920  39871528.0       14.4
48               Angola  2015  Developing  ...   3695.793748   2785935.0       11.4
64  Antigua and Barbuda  2015  Developing  ...  13566.954100         NaN       13.9

[5 rows x 7 columns]

Últimas 5 linhas do DataFrame

                                 Country  Year  ...  Population  Schooling
2858  Venezuela (Bolivarian Republic of)  2015  ...         NaN       14.3
2874                            Viet Nam  2015  ...         NaN       12.6
2890                               Yemen  2015  ...         NaN        9.0
2906                              Zambia  2015  ...    161587.0       12.5
2922                            Zimbabwe  2015  ...  15777451.0       10.3

[5 rows x 7 columns]

In [ ]:
# Reshape do DataFrame 1

# Invertendo a coluna 2015 para linha e renomeando para Year, e adicionando o valores da mesma como hours
df1 = pd.melt(df1,id_vars=['country'],var_name='Year',value_name='Hours')
df1 = df1.rename(columns={'country':'Country'})

df1

                  Country  Year  Hours
0                   Aruba  2015    NaN
1                 Albania  2015   39.6
2    United Arab Emirates  2015    NaN
3               Argentina  2015   42.9
4                 Armenia  2015   37.9
..                    ...   ...    ...
132               Vietnam  2015   41.3
133                 Samoa  2015    NaN
134                 Yemen  2015    NaN
135          South Africa  2015   43.3
136              Zimbabwe  2015    NaN

[137 rows x 3 columns]

In [ ]:
# Qualidade dos dados

print(f'Verificando valores nulos\n')
display(df1.isnull().sum())

# Retirando os valores nulos da coluna Hours
df1 = df1[~ np.isnan(df1['Hours'])]

print(f'\nValores Nulos desconsiderados\n')
display(df1.isnull().sum())

print(f'\nDescrição resumido dos dados\n')
display(df1.describe())

Verificando valores nulos

Country     0
Year        0
Hours      48
dtype: int64

Valores Nulos desconsiderados

Country    0
Year       0
Hours      0
dtype: int64

Descrição resumido dos dados

           Hours
count  89.000000
mean   40.230337
std     3.977476
min    32.400000
25%    37.400000
50%    39.500000
75%    42.900000
max    50.000000

In [ ]:
# 

display(df1.sort_index())

           Country  Year  Hours
1          Albania  2015   39.6
3        Argentina  2015   42.9
4          Armenia  2015   37.9
5        Australia  2015   33.4
6          Austria  2015   35.6
..             ...   ...    ...
125         Turkey  2015   46.4
128        Ukraine  2015   39.0
130  United States  2015   36.7
132        Vietnam  2015   41.3
135   South Africa  2015   43.3

[89 rows x 3 columns]